In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
username = 'root' # default username for MySQL db is root
password = 'Hcruise20' # whatever password you chose during MySQL installation.

connection = f'mysql+pymysql://{username}:{urlquote(password)}@localhost/movies'
engine = create_engine(connection)

In [3]:
import json, os

In [4]:
# Load in data for basics
basics = pd.read_csv('Data/title-basics.csv')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74616 entries, 0 to 74615
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          74616 non-null  object
 1   titleType       74616 non-null  object
 2   primaryTitle    74616 non-null  object
 3   originalTitle   74616 non-null  object
 4   isAdult         74616 non-null  int64
 5   startYear       74616 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  74616 non-null  int64
 8   genres          74616 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.1+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [5]:
# Load in data for ratings
ratings = pd.read_csv('Data/title-ratings.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 61745 entries, 0 to 61744
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         61745 non-null  object
 1   averageRating  61745 non-null  float64
 2   numVotes       61745 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.4+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [6]:
def string_lengths(df):
    print("\nSTRING COLUMN MAX LENGTHS:")
    for col in df.select_dtypes('object').columns:
        length =  df[col].fillna('').map(len).max()
        print(f"- {col}: {length}")

In [7]:
# Show column lengths for ratings df
string_lengths(ratings)

STRING COLUMN MAX LENGTHS:
- tconst: 10

In [8]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings

In [9]:
q = """DESCRIBE title_basics;"""
pd.read_sql(q, engine)

           Field          Type Null  Key Default Extra
0         tconst   varchar(15)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [10]:
col_map = {'tconst':'tconst',
        'primaryTitle':'primary_title',
        'startYear':'start_year',
        'runtimeMinutes':'runtime'}

basics_db = basics[col_map.keys()]
basics_db = basics_db.rename(col_map, axis=1)
basics_db

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126
...,...,...,...,...
74611,tt6353976,Please Come with Me,2018.0,92
74612,tt6354056,Code Name: Dynastud,2018.0,94
74613,tt6354108,Self-Criticism of a Bourgeois Dog,2017.0,99
74614,tt6354270,Ultimate Redemption,2016.0,93
74615,tt6354568,Camp Wedding,2019.0,97

In [11]:
basics_db.to_sql("title_basics", engine, index=False, if_exists='append')

74616

In [12]:
q = """DESCRIBE title_basics;"""
pd.read_sql(q, engine)

           Field          Type Null  Key Default Extra
0         tconst   varchar(15)   NO  PRI    None
1  primary_title  varchar(255)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [13]:
# Viewing first five rows from title_basics
q = """SELECT * FROM title_basics LIMIT 5"""
pd.read_sql(q, engine)

      tconst                      primary_title  start_year  runtime
0  tt6354568                       Camp Wedding        2019       97
1  tt6354270                Ultimate Redemption        2016       93
2  tt6354108  Self-Criticism of a Bourgeois Dog        2017       99
3  tt6354056                Code Name: Dynastud        2018       94
4  tt6353976                Please Come with Me        2018       92

In [15]:
q = """DESCRIBE title_ratings;"""
pd.read_sql(q, engine)

             Field         Type Null  Key Default Extra
0           tconst  varchar(55)   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

In [16]:
col_map = {'tconst':'tconst',
        'averageRating':'average_rating',
        'numVotes':'number_of_votes',
          }

ratings_db = ratings[col_map.keys()]
ratings_db = ratings_db.rename(col_map, axis=1)
ratings_db

          tconst  average_rating  number_of_votes
0      tt0035423             6.4            87153
1      tt0062336             6.4              175
2      tt0069049             6.7             7754
3      tt0088751             5.2              336
4      tt0096056             5.6              846
...          ...             ...              ...
61740  tt6353976             5.0              197
61741  tt6354056             3.6              285
61742  tt6354108             6.7              488
61743  tt6354270             5.9               22
61744  tt6354568             3.3             1784

[61745 rows x 3 columns]

In [17]:
ratings_db.to_sql("title_ratings", engine, index=False, if_exists='append')

61745

In [18]:
q = """DESCRIBE title_ratings;"""
pd.read_sql(q, engine)

             Field         Type Null  Key Default Extra
0           tconst  varchar(55)   NO  PRI    None
1   average_rating  varchar(45)  YES         None
2  number_of_votes          int  YES         None

In [20]:
# Viewing first five rows from title_ratings
q = """SELECT * FROM title_ratings LIMIT 5"""
pd.read_sql(q, engine)

      tconst average_rating  number_of_votes
0  tt0035423            6.4            87153
1  tt0062336            6.4              175
2  tt0069049            6.7             7754
3  tt0088751            5.2              336
4  tt0096056            5.6              846